# Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.
n = int(input('ВВЕДИТЕ СЕКУНДЫ: '))
if (n / 60) > 59:
    H = int(n / 3600)
    M = int((n - H * 3600) / 60)
    S = (n - H * 3600 - M * 60)
else:
    H = 0
    M = int(n / 60)
    S = (n - M * 60)
# print(H, M, S)
print(f"{H}:{M}:{S}")
